tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask", "git@github.com:Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "yt-dlp/taps"
brew "act", args: ["HEAD"]
brew "autoconf"
brew "python@3.10"
brew "autojump"
brew "automake"
brew "bats-core"
brew "glib"
brew "boxes"
brew "calc"
brew "clojure"
brew "cmake"
brew "consul-template"
brew "cowsay"
brew "gawk"
brew "gnu-sed"
brew "grep"
brew "ctags"
brew "curl"
brew "direnv"
brew "dust"
brew "gnutls"
brew "ffmpeg"
brew "figlet"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "hexyl"
brew "htop"
brew "imagemagick"
brew "influxdb@1"
brew "jinja2-cli"
brew "kcat"
brew "lolcat"
brew "luarocks"
brew "moreutils"
brew "mysql-client"
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "ninja"
brew "nmap"
brew "node"
brew "nvm"
brew "nyancat"
brew "open-ocd", args: ["HEAD"]
brew "openssh"
brew "packer"
brew "pcalc"
brew "perl"
brew "pigz"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "platformio"
brew "ponysay"
brew "postgresql@14"
brew "pre-commit"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "python-yq"
brew "qemu"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "rust-analyzer"
brew "shellcheck"
brew "squashfs"
brew "stlink"
brew "tfenv"
brew "the_silver_searcher"
brew "tilt"
brew "tio"
brew "tmux"
brew "toilet"
brew "tree"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "hashicorp/tap/terraform", link: false
brew "yt-dlp/taps/yt-dlp"
cask "android-sdk"
cask "bloomrpc"
cask "font-fira-code"
# cask "gcc-arm-embedded"
cask "insomnia"
cask "key-codes"
cask "openscad"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "wireshark"
